alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
<?xml version="1.0" encoding="utf-8"?> 


<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
	xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
	<name>LPC18xx</name>
	<version>19</version>
	<description>Register cmsis file for LPC18xx parts</description>
	<!-- Bus Interface Properties -->
	<!-- Cortex-M3 is byte addressable -->
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<size>32</size>
	                                          <!-- Name for DoxyGroup -->
	
	
	

	<!-- changes:
  v3: CGU updated with IDIVB/C/D registers
  v3: GPIO added
  v4: replace all <name>test</name> by <name>ENUM</name>
  v4: USB0 - PORTSC1_H register added
  v5: add <headerFile> tag for including prefixes
  v5: <device><name> = LPC18xx 
  v5: register address of CGU register OUTCLK3 fixed (offset = 0x54)
  V5: ETBCFG register added in CREG block
  v5: REGFILE block added at 0x4004 1000 (manually)
  v6: <headerFile> tag removed to comply with cmsis
  v7: make <access>, <bitRange>, <resetValue>, <resetMask> cmsis compliant 
  v8: replace syscon sfspx_y and sfsclkx registers with registers that have the actual function value
      but this creates another issue: now that all the func values are specified and different for each register I can't create
	  an indexed register anymore
	  also added the interrupts for each peripheral from the user manual
  v9: fix offset of the USART HDEN register = +0x040 and replace R/W by read-write in system contol pin registers  
  v10: now this becomes falcon/eagle rev a part with many changes to the register map as follows:
      - add GPIO pin interrupt block from LPC11U1x v0.5 - field description needs to be updated!
      - add GPIO group pin interrupt blocks from LPC11U1x v0.5 but change dim to 5 for 5 GPIO ports - field description needs to be updated!
      - add GPIO port block from LPC11U1x v0.5; change dim to 192 for byte and word registers; change dim to 5 for all others; field description still needs to  be updated
      - C_CAN renamed to C_CAN0 and C_CAN1 added
      - I2S renamed to I2S0 and I2S1 added
      - CGU replaced with falcon cgu
      - sdmmc added
  v11:  - Number of gpio ports increased to 8
  		- scu updated with falcon scu - no functions yet
  		- GIMA block added
  		- CCU1 VADC and CAN1 registers added; CAN registers renamed to a CAN0 registers
  		- RGU CAN1 reset added #56
  		- CGU branch clock 0 for Audio PLL added for CCU2
  		- the sdmmc registers need review - the header file comes out ok but the register descriptions have problems which causes problems with the sdconv
  		  I don't know why the errors with the sdmmc are not always flagged
  		- event router interrupt changed to  42 
  		- LCD PAL and CRS IMG registers created with correct dimensions
  v12:  - spifi register interface removed because it does not describe the redesigned spifi and  never worked on the rev- version
        - gpio port and gpio group0 group1 register bit descripiton text updated to use GPIOn[m] for GPIO port functions
        - creg block updated with falcon creg
        - RIT: description of field RIMASK updated according to UM10430_v0.12 
  v13:  - USB0, USB1, USART0, SCU: fixed some errors in bit field width flagged by the create-fields option
        - RGU registers extracted from UM v.13 (CAN1 reset moved to reset 54) 
        - fixed some empty description and name tags
        - SD/MMC registers fixed
  v14:  - remove all empty enumerated value tags to pass latest cmsis schema (as of 7/29/2011)  
  v15: - update creg block from UM10430 v0.14
       - fix some bitfield errors in creg, rtc, uart1
       - CCU VADC registers moved to 0xB00 and 0xB04
  v16: - cgu pll0audio_mdiv @ + 0x34 bits 31:17 are reserved
  v17: - aes reset/clock/dma removed
  		- usart osr register added
  		- scu: all emc delay register removed except emcdelayclk
  v18: - alternate register tags added
       - identical bitfield names updated
       - errant characters removed
       - cgu base clock register names changed to use base clock names
       - cgu idivc,d registers added
       
   v19: -ethernet updated
        - pmucon register removed in creg
	-->





 

	<headerFile>
		<prefixes>
			<peripheral>LPC_</peripheral>
		</prefixes>
	</headerFile>






	<peripherals>
		<peripheral>
			<name>SCT</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx State Configurable Timer (SCT) Modification date=1/18/2011 Major revision=0 Minor revision=7 </description>
			<groupName>SCT</groupName>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SCT</name>
				<value>10</value>

			</interrupt>
			<registers>
				<register>
					<name>CONFIG</name>
					<description>SCT configuration register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00007E00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>UNIFY</name>
							<description>SCT operation</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>16_BIT_COUNTERS</name>
									<description>The SCT operates as two 16-bit counters named L and H.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_BIT_UNIFIED</name>
									<description>The SCT operates as a unified 32-bit counter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKMODE</name>
							<description>SCT clock mode</description>
							<bitRange>[2:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BUS_CLOCK</name>
									<description>The SCT and prescaler(s) are clocked by the bus clock.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH_PERFORMANCE</name>
									<description>The SCT clock is the bus clock, but the prescaler(s) is (are) enabledto count only when sampling of the input selected by the CKSEfield finds the selected edge. The minimum pulse width on theclock input is 1 bus clock period. This is the highperformance sampled-clock mode.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_POWER</name>
									<description>The SCT and prescaler(s) are clocked by the input selected by CKSEL, synchronized to the bus clock and possibly inverted. The minimum pulse width on the clock input is 1 bus clock  period. This is the low-power sampled-clock mode.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INPUT_EDGE</name>
									<description>The SCT and prescaler(s) are clocked by the input edge selected by the CKSEL field. In this mode the following is true: Most of the SCT is clocked by the (selected polarity of the)  input. Outputs are switched synchronously to the input clock. The input clock rate must be at least half the bus clock rate and  can be faster than the bus clock.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>SCT clock select</description>
							<bitRange>[6:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INP0_RISING</name>
									<description>Rising edges on input 0.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP0_FALLING</name>
									<description>Falling edges on input 0.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP1_RISING</name>
									<description>Rising edges on input 1.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP1_FALLING</name>
									<description>Falling edges on input 1.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP2_RISING</name>
									<description>Rising edges on input 2.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP2_FALLING</name>
									<description>Falling edges on input 2.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP3_RISING</name>
									<description>Rising edges on input 3.</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP3_FALLING</name>
									<description>Falling edges on input 3.</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP4_RISING</name>
									<description>Rising edges on input 4.</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP4_FALLING</name>
									<description>Falling edges on input 4.</description>
									<value>0x9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP5_RISING</name>
									<description>Rising edges on input 5.</description>
									<value>0xA</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP5_FALLING</name>
									<description>Falling edges on input 5.</description>
									<value>0xB</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP6_RISING</name>
									<description>Rising edges on input 6.</description>
									<value>0xC</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP6_FALLING</name>
									<description>Falling edges on input 6.</description>
									<value>0xD</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP7_RISING</name>
									<description>Rising edges on input 7.</description>
									<value>0xE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INP7_FALLING</name>
									<description>Falling edges on input 7.</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NORELAODL_NORELOADU</name>
							<description>A 1 in this bit prevents the lower match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit applies to both the  higher and lower registers when the UNIFY bit is set.</description>
							<bitRange>[7:7]</bitRange>
							
