alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
				<register>
					<name>RAWINTERRSTAT</name>
					<description>DMA Raw Error Interrupt Status Register</description>
					<addressOffset>0x018</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RAWINTERRSTAT0</name>
							<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RAWINTERRSTAT1</name>
							<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RAWINTERRSTAT2</name>
							<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RAWINTERRSTAT3</name>
							<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>RAWINTERRSTAT4</name>
							<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>RAWINTERRSTAT5</name>
							<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>RAWINTERRSTAT6</name>
							<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RAWINTERRSTAT7</name>
							<description>Status of the error interrupt for DMA channels prior to masking. Each bit represents one channel: 0 - the corresponding channel has no active error interrupt request. 1 - the corresponding channel does have an active error interrupt request.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENBLDCHNS</name>
					<description>DMA Enabled Channel Register</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENABLEDCHANNELS0</name>
							<description>Enable status for DMA channels. Each bit represents one channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>ENABLEDCHANNELS1</name>
							<description>Enable status for DMA channels. Each bit represents one channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ENABLEDCHANNELS2</name>
							<description>Enable status for DMA channels. Each bit represents one channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>ENABLEDCHANNELS3</name>
							<description>Enable status for DMA channels. Each bit represents one channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ENABLEDCHANNELS4</name>
							<description>Enable status for DMA channels. Each bit represents one channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>ENABLEDCHANNELS5</name>
							<description>Enable status for DMA channels. Each bit represents one channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ENABLEDCHANNELS6</name>
							<description>Enable status for DMA channels. Each bit represents one channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>ENABLEDCHANNELS7</name>
							<description>Enable status for DMA channels. Each bit represents one channel: 0 - DMA channel is disabled. 1 - DMA channel is enabled.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SOFTBREQ</name>
					<description>DMA Software Burst Request Register</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SOFTBREQ0</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ1</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ2</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ3</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ4</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ5</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ6</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ7</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ8</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ9</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ10</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ11</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ12</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ13</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ14</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>SOFTBREQ15</name>
							<description>Software burst request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function (refer to Table 136 for peripheral hardware connections to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1 generates a DMA burst request for the corresponding request line.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined. Write reserved bits as zero.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SOFTSREQ</name>
					<description>DMA Software Single Request Register</description>
					<addressOffset>0x024</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SOFTSREQ0</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ1</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ2</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ3</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ4</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ5</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ6</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ7</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ8</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ9</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ10</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ11</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ12</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ13</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ14</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>SOFTSREQ15</name>
							<description>Software single transfer request flags for each of 16 possible sources. Each bit represents one DMA request line or peripheral function: 0 - writing 0 has no effect. 1 - writing 1 generates a DMA single transfer request for the corresponding request line.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined. Write reserved bits as zero.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
