alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
					</fields>
				</register>
				<register>
					<name>SYNC</name>
					<description>DMA Synchronization Register</description>
					<addressOffset>0x034</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DMACSYNC0</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DMACSYNC1</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DMACSYNC2</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DMACSYNC3</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DMACSYNC4</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DMACSYNC5</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>DMACSYNC6</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DMACSYNC7</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>DMACSYNC8</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DMACSYNC9</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DMACSYNC10</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DMACSYNC11</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DMACSYNC12</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>DMACSYNC13</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>DMACSYNC14</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>DMACSYNC15</name>
							<description>Controls the synchronization logic for DMA request signals. Each bit represents one set of DMA request lines as described in the preceding text: 0 - synchronization logic for the corresponding DMA request signals are disabled. 1 - synchronization logic for the corresponding request line signals are enabled.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Read undefined. Write reserved bits as zero.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>C%sSRCADDR</name>
					<description>DMA Channel  Source Address Register</description>
					<addressOffset>0x100</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SRCADDR</name>
							<description>DMA source address. Reading this register will return the current source address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>C%sDESTADDR</name>
					<description>DMA Channel  Destination Address Register</description>
					<addressOffset>0x104</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DESTADDR</name>
							<description>DMA Destination address. Reading this register will return the current destination address.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x20</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>C%sLLI</name>
					<description>DMA Channel Linked List Item Register</description>
					<addressOffset>0x108</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LM</name>
							<description>AHB master select for loading the next LLI:</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AHB_MASTER_0_</name>
									<description>AHB Master 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AHB_MASTER_1_</name>
									<description>AHB Master 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>R</name>
							<description>Reserved, and must be written as 0, masked on read.</description>
							<bitRange>[1:1]</bitRange>
							
