alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
						<field>
							<name>RESPONSE_EXPECT</name>
							<description>response expect</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NORESPONSE</name>
									<description>No response expected from card</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESPONSE</name>
									<description>Response expected from card</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESPONSE_LENGTH</name>
							<description>response length</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SHORTRESPONSE</name>
									<description>Short response expected from card</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LONGRESPONSE</name>
									<description>Long response expected from card</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHECK_RESPONSE_CRC</name>
							<description>check  response crc Some of command responses do not return valid CRC bits.
Software should disable CRC checks for those commands in order
to disable CRC checking by controller.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DONOTCHECKCRC</name>
									<description>Do not check response CRC</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHECKCRC</name>
									<description>Check response CRC</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DATA_EXPECTED</name>
							<description>data expected</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NODATATXF</name>
									<description>No data transfer expected (read/write)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATATXF</name>
									<description>Data transfer expected (read/write)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>READ_WRITE</name>
							<description>read/write. Don't care if no data expected from card.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>READCARD</name>
									<description>Read from card</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DATATXF</name>
									<description>Data transfer expected (read/write)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRANSFER_MODE</name>
							<description>transfer mode. Don' t care if no data expected.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>BLOCKTXF</name>
									<description>Block data transfer command</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STREAMTXF</name>
									<description>Stream data transfer command</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEND_AUTO_STOP</name>
							<description>send auto stop.  When set, DWC_mobile_storage sends stop command to
SD_MMC_CEATA cards at end of data transfer. Refer to Table 3-8
on page 93 to determine:
* when send_auto_stop bit should be set, since some data
transfers do not need explicit stop commands
* open-ended transfers that software should explicitly send to
stop command
Additionally, when  resume  is sent to resume - suspended memory
access of SD-Combo card - bit should be set correctly if suspended
data transfer needs send_auto_stop.
Don't care if no data expected from card.</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOSTOP</name>
									<description>No stop command sent at end of data transfer</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOP</name>
									<description>Send stop command at end of data transfer</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAIT_PRVDATA_COMPLETE</name>
							<description>wait prvdata complete. The wait_prvdata_complete = 0 option typically used to query
status of card during data transfer or to stop current data transfer;
card_number should be same as in previous command.</description>
							<bitRange>[13:13]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SEND</name>
									<description>Send command at once, even if previous data transfer has not
completed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAIT</name>
									<description>Wait for previous data transfer completion before sending
command.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STOP_ABORT_CMd</name>
							<description>stop abort cmd. When open-ended or predefined data transfer is in progress, and
host issues stop or abort command to stop data transfer, bit should
be set so that command/data state-machines of CIU can return
correctly to idle state. This is also applicable for Boot mode
transfers. To Abort boot mode, this bit should be set along with
CMD[26] = disable_boot.</description>
							<bitRange>[14:14]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOSTOPABORT</name>
									<description>Neither stop nor abort command to stop current data transfer
in progress. If abort is sent to function-number currently
selected or not in data-transfer mode, then bit should be set
to 0.
</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STOPABORT</name>
									<description>Stop or abort command intended to stop current data transfer
in progress..</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEND_INITIALIZATION</name>
							<description>send initialization.  After power on, 80 clocks must be sent to card for initialization
before sending any commands to card. Bit should be set while
sending first command to card so that controller will initialize clocks
before sending command to card. This bit should not be set for
either of the boot modes (alternate or mandatory).</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOINIT</name>
									<description>Do not send initialization sequence (80 clocks of 1) before
sending this command.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INIT</name>
									<description>Send initialization sequence before sending this command.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CARD_NUMBER</name>
							<description>card number. Card number in use. Represents physical slot number of card being
accessed. In MMC-Ver3.3-only mode, up to 30 cards are supported;
in SD-only mode, up to 16 cards are supported. Registered version
of this is reflected on dw_dma_card_num and ge_dma_card_num
ports, which can be used to create separate DMA requests, if
needed.
In addition, in SD mode this is used to mux or demux signals from
selected card because each card is interfaced to
DWC_mobile_storage by separate bus.</description>
							<bitRange>[20:16]</bitRange>
							
