alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
						<field>
							<name>RXT1_0</name>
							<description>Endpoint type Endpoint 0 is always a control endpoint.</description>
							<bitRange>[3:2]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[6:4]</bitRange>
							
						</field>
						<field>
							<name>RXE</name>
							<description>Rx endpoint enable Endpoint enabled. Control endpoint 0 is always enabled. This bit is always 1.</description>
							<bitRange>[7:7]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[15:8]</bitRange>
							
						</field>
						<field>
							<name>TXS</name>
							<description>Tx endpoint stall</description>
							<bitRange>[16:16]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENDPOINT_OK_</name>
									<description>Endpoint ok.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT_STALLED_SOF</name>
									<description>Endpoint stalled Software can write a one to this bit to force the endpoint to return a STALL handshake to the Host. It will continue returning STALL until the bit is cleared by software, or it will automatically be cleared upon receipt of a new SETUP request. After receiving a SETUP request, this bit will continue to be cleared by hardware until the associated ENDSETUPSTAT bit is cleared.[1]</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[17:17]</bitRange>
							
						</field>
						<field>
							<name>TXT1_0</name>
							<description>Endpoint type Endpoint 0 is always a control endpoint.</description>
							<bitRange>[19:18]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[22:20]</bitRange>
							
						</field>
						<field>
							<name>TXE</name>
							<description>Tx endpoint enable Endpoint enabled. Control endpoint 0 is always enabled. This bit is always 1.</description>
							<bitRange>[23:23]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>reserved</description>
							<bitRange>[31:24]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<dim>5</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>1-5</dimIndex>
					<name>ENDPTCTRL%s</name>
					<description>Endpoint control </description>
					<addressOffset>0x1C4</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXS</name>
							<description>Rx endpoint stall</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENDPOINT_OK_THIS_BI</name>
									<description>Endpoint ok. This bit will be cleared automatically upon receipt of a SETUP request if this Endpoint is configured as a Control Endpoint and this bit will continue to be cleared by hardware until the associated ENDPTSETUPSTAT bit is cleared.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENDPOINT_STALLED_SOF</name>
									<description>Endpoint stalled Software can write a one to this bit to force the endpoint to return a STALL handshake to the Host. It will continue returning STALL until the bit is cleared by software, or it will automatically be cleared upon receipt of a new SETUP request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[1:1]</bitRange>
							
						</field>
						<field>
							<name>RXT</name>
							<description>Endpoint type</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CONTROL</name>
									<description>Control</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ISOCHRONOUS</name>
									<description>Isochronous</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BULK</name>
									<description>Bulk</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[4:4]</bitRange>

							
						</field>
						<field>
							<name>RXI</name>
							<description>Rx data toggle inhibit This bit is only used for test and should always be written as zero. Writing a one to this bit will cause this endpoint to ignore the data toggle sequence and always accept data packets regardless of their data PID.</description>
							<bitRange>[5:5]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXR</name>
							<description>Rx data toggle reset Write 1 to reset the PID sequence. Whenever a configuration event is received for this Endpoint, software must write a one to this bit in order to synchronize the data PIDs between the host and device.</description>
							<bitRange>[6:6]</bitRange>

							
