alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
				</field>
			</fields>
		</register>
		<register>
			<name>CREG6</name>
			<description>Chip configuration register 6</description>
			<addressOffset>0x12C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>ETHMODE</name>
					<description>Selects the Ethernet mode. Reset the ethernet after changing the PHY interface. All other settings are reserved.</description>
					<bitRange>[2:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>MII</name>
							<description>MII</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RMII</name>
							<description>RMII</description>
							<value>0x4</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[3:3]</bitRange>
					
				</field>
				<field>
					<name>TIMCTRL</name>
					<description>TBD</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TBD</name>
							<description>TBD</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TBD</name>
							<description>TBD</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[11:5]</bitRange>
					
				</field>
				<field>
					<name>I2S0_TX_SCK_IN_SEL</name>
					<description>I2S0_TX_SCK input select</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>I2_S_CLOCK_SELECTED_</name>
							<description>I2 S clock selected as defined by the I2S transmit mode register Table 753.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AUDIO_PLL_FOR_I2S_TR</name>
							<description>Audio PLL for I2S transmit clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2S0_RX_SCK_IN_SEL</name>
					<description>I2S0_RX_SCK input select</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>I2_S_CLOCK_SELECTED_</name>
							<description>I2 S clock selected as defined by the I2S receive mode register Table 754.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AUDIO_PLL_FOR_I2S_RE</name>
							<description>Audio PLL for I2S receive clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2S1_TX_SCK_IN_SEL</name>
					<description>I2S1_TX_SCK input select</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>I2_S_CLOCK_SELECTED_</name>
							<description>I2 S clock selected as defined by the I2S transmit mode register Table 753.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AUDIO_PLL_FOR_I2S_TR</name>
							<description>Audio PLL for I2S transmit clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>I2S1_RX_SCK_IN_SEL</name>
					<description>I2S1_RX_SCK input select</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>I2_S_CLOCK_SELECTED_</name>
							<description>I2 S clock selected as defined by the I2S receive mode register Table 754.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>AUDIO_PLL_FOR_I2S_RE</name>
							<description>Audio PLL for I2S receive clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EMC_CLK_SEL</name>
					<description>EMC_CLK divided clock select (see Section 20.1).</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>EMC_CLK_DIV_NOT_DIVI</name>
							<description>EMC_CLK_DIV not divided.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EMC_CLK_DIV_DIVIDED_</name>
							<description>EMC_CLK_DIV divided by 2.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[31:17]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<name>CHIPID</name>
			<description>Part ID</description>
			<addressOffset>0x200</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>ID</name>
					<description>TBD</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>

<peripheral>
			<name>EVENTROUTER</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx Event router Modification date=1/20/2011 Major revision=0 Minor revision=7 </description>
			<groupName>EVENTROUTER</groupName>
			<baseAddress>0x40044000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EVENTROUTER_INT</name>
				<value>42</value>

			</interrupt>
			<registers>
				<register>
					<name>HILO</name>
					<description>Level configuration register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WAKEUP0_L</name>
							<description>Level detect mode for WAKEUP0 event.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 0 in the EDGE register is 0. Detect falling edge if bit 0 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 0 in the EDGE register is 0. Detect rising edge if bit 0 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP1_L</name>
							<description>Level detect mode for WAKEUP1 event. The corresponding bit in the EDGE register must be 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 1 in the EDGE register is 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 1 in the EDGE register is 0. Detect rising edge if bit 1 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP2_L</name>
							<description>Level detect mode for WAKEUP2 event.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 2 in the EDGE register is 0. Detect falling edge if bit 2 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 2 in the EDGE register is 0. Detect rising edge if bit 2 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP3_L</name>
							<description>Level detect mode for WAKEUP3 event.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 3 in the EDGE register is 0. Detect falling edge if bit 3 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 3 in the EDGE register is 0. Detect rising edge if bit 3 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ATIMER_L</name>
							<description>Level detect mode for alarm timer event.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 4 in the EDGE register is 0. Detect falling edge if bit 4 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 4 in the EDGE register is 0. Detect rising edge if bit 4 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC_L</name>
							<description>Level detect mode for RTC event.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 5 in the EDGE register is 0. Detect falling edge if bit 5 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 5 in the EDGE register is 0. Detect rising edge if bit 5 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOD_L</name>
							<description>Level detect mode for BOD event.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 6 in the EDGE register is 0. Detect falling edge if bit 6 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 6 in the EDGE register is 0. Detect rising edge if bit 6 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WWDT_L</name>
							<description>Level detect mode for WWDTD event.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 7 in the EDGE register is 0. Detect falling edge if bit 7 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 7 in the EDGE register is 0. Detect rising edge if bit 7 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ETH_L</name>
							<description>Level detect mode for ethernet event.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 8 in the EDGE register is 0. Detect falling edge if bit 8 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 8 in the EDGE register is 0. Detect rising edge if bit 8 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USB0_L</name>
							<description>Level detect mode for USB0 event.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 9 in the EDGE register is 0. Detect falling edge if bit 9 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 9 in the EDGE register is 0. Detect rising edge if bit 9 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USB1_L</name>
							<description>Level detect mode for USB1 event.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DETECT_LOW_LEVEL_IF_</name>
									<description>Detect LOW level if bit 10 in the EDGE register is 0. Detect falling edge if bit 10 in the EDGE register is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DETECT_HIGH_LEVEL_IF</name>
									<description>Detect HIGH level if bit 10 in the EDGE register is 0. Detect rising edge if bit 10 in the EDGE register is 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[11:11]</bitRange>
							
