alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
					</fields>
				</register>
				<register>
					<name>PLL0USB_STAT</name>
					<description>PLL0 (USB) status register</description>
					<addressOffset>0x01C</addressOffset>
					<access>read-only</access>
					<resetValue>0x01000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LOCK</name>
							<description>PLL0 lock indicator</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>FR</name>
							<description>PLL0 free running indicator</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:2]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PLL0USB_CTRL</name>
					<description>PLL0 (USB) control register</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x01000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PD</name>
							<description>PLL0 power down</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PLL0_ENABLED</name>
									<description>PLL0 enabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL0_POWERED_DOWN</name>
									<description>PLL0 powered down</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BYPASS</name>
							<description>Input clock bypass control</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CCO_CLOCK_SENT_TO_PO</name>
									<description>CCO clock sent to post-dividers. Use this in normal operation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL0_INPUT_CLOCK_SEN</name>
									<description>PLL0 input clock sent to post-dividers (default).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIRECTI</name>
							<description>PLL0 direct input</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>DIRECTO</name>
							<description>PLL0 direct output</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>CLKEN</name>
							<description>PLL0 clock enable</description>
							<bitRange>[4:4]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[5:5]</bitRange>
							
						</field>
						<field>
							<name>FRM</name>
							<description>Free running mode</description>
							<bitRange>[6:6]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[7:7]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Reads as zero. Do not write one to this register.</description>
							<bitRange>[8:8]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Reads as zero. Do not write one to this register.</description>
							<bitRange>[9:9]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Reads as zero. Do not write one to this register.</description>
							<bitRange>[10:10]</bitRange>
							
						</field>
						<field>
							<name>AUTOBLOCK</name>
							<description>Block clock automatically during frequency change</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>AUTOBLOCKING_DISABLE</name>
									<description>Autoblocking disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTOBLOCKING_ENABLED</name>
									<description>Autoblocking enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[23:12]</bitRange>
							
						</field>
						<field>
							<name>CLK_SEL</name>
							<description>Clock source selection. All other values are reserved.</description>
							<bitRange>[28:24]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>32_KHZ_OSCILLATOR</name>
									<description>32 kHz oscillator</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IRC_DEFAULT)</name>
									<description>IRC (default)</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_RX_CLK</name>
									<description>ENET_RX_CLK</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENET_TX_CLK</name>
									<description>ENET_TX_CLK</description>
									<value>0x03</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GP_CLKIN</name>
									<description>GP_CLKIN</description>
									<value>0x04</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CRYSTAL_OSCILLATOR</name>
									<description>Crystal oscillator</description>
									<value>0x06</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLL1</name>
									<description>PLL1</description>
									<value>0x09</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVA</name>
									<description>IDIVA</description>
									<value>0x0C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVB</name>
									<description>IDIVB</description>
									<value>0x0D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVC</name>
									<description>IDIVC</description>
									<value>0x0E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVD</name>
									<description>IDIVD</description>
									<value>0x0F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IDIVE</name>
									<description>IDIVE</description>
									<value>0x10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:29]</bitRange>
							
