alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_USB1_CFG</name>
					<description>CLK_USB1 clock configuration register</description>
					<addressOffset>0x900</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable</description>
							<bitRange>[0:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>CLOCK_IS_DISABLED_</name>
									<description>Clock is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCK_IS_ENABLED_</name>
									<description>Clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable</description>
							<bitRange>[1:1]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>AUTO_IS_DISABLED_</name>
									<description>Auto is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_IS_ENABLED_</name>
									<description>Auto is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable</description>
							<bitRange>[2:2]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>WAKE_UP_IS_DISABLED_</name>
									<description>Wake-up is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKE_UP_IS_ENABLED_</name>
									<description>Wake-up is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

							
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_VADC_CFG</name>
					<description>CLK_VADC clock configuration register</description>
					<addressOffset>0xB00</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable</description>
							<bitRange>[0:0]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>CLOCK_IS_DISABLED_</name>
									<description>Clock is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLOCK_IS_ENABLED_</name>
									<description>Clock is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable</description>
							<bitRange>[1:1]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>AUTO_IS_DISABLED_</name>
									<description>Auto is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AUTO_IS_ENABLED_</name>
									<description>Auto is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable</description>
							<bitRange>[2:2]</bitRange>

							<enumeratedValues>
								<name>ENUM</name>

								<enumeratedValue>
									<name>WAKE_UP_IS_DISABLED_</name>
									<description>Wake-up is disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAKE_UP_IS_ENABLED_</name>
									<description>Wake-up is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

							
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_APB3_BUS_STAT</name>
					<description>CLK_APB3_BUS clock status register</description>
					<addressOffset>0x104</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_APB3_I2C1_STAT</name>
					<description>CLK_APB3_I2C1 clock status register</description>
					<addressOffset>0x010C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

