alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
					</fields>
				</register>
				<register>
					<name>LSR</name>
					<description>Line Status Register. Contains flags for transmit and receive status, including line errors.</description>
					<addressOffset>0x014</addressOffset>
					<access>read-only</access>
					<resetValue>0x60</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RDR</name>
							<description>Receiver Data Ready. LSR bit  0 is set when the RBR holds an unread character and is cleared when the UART RBR FIFO is empty.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RBR_IS_EMPTY_</name>
									<description>RBR is empty.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RBR_CONTAINS_VALID_D</name>
									<description>RBR contains valid data.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OE</name>
							<description>Overrun Error. The overrun error condition is set as soon as it occurs. A LSR read clears LSR bit  1. LSR bit  1 is set when UART RSR has a new character assembled and the UART RBR FIFO is full. In this case, the UART RBR FIFO will not be overwritten and the character in the UART RSR will be lost.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Overrun error status is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Overrun error status is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PE</name>
							<description>Parity Error. When the parity bit of a received character is in the wrong state, a parity error occurs. A LSR read clears LSR bit  2. Time of parity error detection is dependent on FCR bit  0. Note: A parity error is associated with the character at the top of the UART RBR FIFO.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Parity error status is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Parity error status is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FE</name>
							<description>Framing Error. When the stop bit of a received character is a logic 0, a framing error occurs. A LSR read clears LSR bit  3. The time of the framing error detection is dependent on FCR0. Upon detection of a framing error, the RX will attempt to re-synchronize to the data and assume that the bad stop bit is actually an early start bit. However, it cannot be assumed that the next received byte will be correct even if there is no Framing Error. Note: A framing error is associated with the character at the top of the UART RBR FIFO.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Framing error status is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Framing error status is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BI</name>
							<description>Break Interrupt. When RXD1 is held in the spacing state (all zeros) for one full character transmission (start, data, parity, stop), a break interrupt occurs. Once the break condition has been detected, the receiver goes idle until RXD1 goes to marking state (all ones). A LSR read clears this status bit. The time of break detection is dependent on FCR bit  0. Note: The break interrupt is associated with the character at the top of the UART RBR FIFO.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Break interrupt status is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Break interrupt status is active.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THRE</name>
							<description>Transmitter Holding Register Empty. THRE is set immediately upon detection of an empty UART THR and is cleared on a THR write.</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THR_CONTAINS_VALID_D</name>
									<description>THR contains valid data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THR_IS_EMPTY_</name>
									<description>THR is empty.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TEMT</name>
							<description>Transmitter Empty. TEMT is set when both THR and TSR are empty; TEMT is cleared when either the TSR or the THR contain valid data.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>VALID</name>
									<description>THR and/or the TSR contains valid data.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EMPTY</name>
									<description>THR and the TSR are empty.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXFE</name>
							<description>Error in RX FIFO. LSR bit  7 is set when a character with a RX error such as framing error, parity error or break interrupt, is loaded into the RBR. This bit is cleared when the LSR register is read and there are no subsequent errors in the UART FIFO.</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RBR_CONTAINS_NO_UART</name>
									<description>RBR contains no UART RX errors or FCR bit  0 =0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UART_RBR_CONTAINS_AT</name>
									<description>UART RBR contains at least one UART RX error.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXERR</name>
							<description>Error in transmitted character.   A NACK response is given by the receiver in Smart card T=0 mode. This bit is cleared when the LSR register is read.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NO_ERROR_(NORMAL_DEF</name>
									<description>No error (normal default condition).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>A_NACK_RESPONSE_IS_R</name>
									<description>A NACK response is received during Smart card T=0 operation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:9]</bitRange>
							
