alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>MR%s</name>
					<description>Match Register. MR can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR matches the TC.</description>
					<addressOffset>0x018</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MATCH</name>
							<description>Timer counter match value.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Capture Control Register. The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place.</description>
					<addressOffset>0x028</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CAP0RE</name>
							<description>Capture on CAPn.0 rising edge</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_SEQUENCE_OF_0_THEN</name>
									<description>A sequence of 0 then 1 on CAPn.0 will cause CR0 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0FE</name>
							<description>Capture on CAPn.0 falling edge</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_SEQUENCE_OF_1_THEN</name>
									<description>A sequence of 1 then 0 on CAPn.0 will cause CR0 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP0I</name>
							<description>Interrupt on CAPn.0 event</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_CR0_LOAD_DUE_TO_A_</name>
									<description>A CR0 load due to a CAPn.0 event will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1RE</name>
							<description>Capture on CAPn.1 rising edge</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_SEQUENCE_OF_0_THEN</name>
									<description>A sequence of 0 then 1 on CAPn.1 will cause CR1 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1FE</name>
							<description>Capture on CAPn.1 falling edge</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_SEQUENCE_OF_1_THEN</name>
									<description>A sequence of 1 then 0 on CAPn.1 will cause CR1 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP1I</name>
							<description>Interrupt on CAPn.1 event</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_CR1_LOAD_DUE_TO_A_</name>
									<description>A CR1 load due to a CAPn.1 event will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP2RE</name>
							<description>Capture on CAPn.2 rising edge</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_SEQUENCE_OF_0_THEN</name>
									<description>A sequence of 0 then 1 on CAPn.2 will cause CR2 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP2FE</name>
							<description>Capture on CAPn.2 falling edge:</description>
							<bitRange>[7:7]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_SEQUENCE_OF_1_THEN</name>
									<description>A sequence of 1 then 0 on CAPn.2 will cause CR2 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP2I</name>
							<description>Interrupt on CAPn.2 event</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_CR2_LOAD_DUE_TO_A_</name>
									<description>A CR2 load due to a CAPn.2 event will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP3RE</name>
							<description>Capture on CAPn.3 rising edge</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_SEQUENCE_OF_0_THEN</name>
									<description>A sequence of 0 then 1 on CAPn.3 will cause CR3 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP3FE</name>
							<description>Capture on CAPn.3 falling edge</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_SEQUENCE_OF_1_THEN</name>
									<description>A sequence of 1 then 0 on CAPn.3 will cause CR3 to be loaded with the contents of TC.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAP3I</name>
							<description>Interrupt on CAPn.3 event:</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>A_CR3_LOAD_DUE_TO_A_</name>
									<description>A CR3 load due to a CAPn.3 event will generate an interrupt.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>THIS_FEATURE_IS_DISA</name>
									<description>This feature is disabled.</description>
									<value>0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
							
