alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
					</fields>
				</register>
				<register>
					<name>CTCR</name>
					<description>Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>
					<addressOffset>0x070</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CTMODE</name>
							<description>Counter/Timer Mode This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). Timer Mode: the TC is incremented when the Prescale Counter matches the Prescale Register.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TIMER_MODE_EVERY_RI</name>
									<description>Timer Mode: every rising PCLK edge</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_MODE_TC_IS_</name>
									<description>Counter Mode: TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_MODE_TC_IS_</name>
									<description>Counter Mode: TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUNTER_MODE_TC_IS_</name>
									<description>Counter Mode: TC is incremented on both edges on the CAP input selected by bits 3:2.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CINSEL</name>
							<description>Count Input Select When bits 1:0 in this register are not 00, these bits select which CAP pin is sampled for clocking:</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CAPN_0_FOR_TIMERN</name>
									<description>CAPn.0 for TIMERn</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPN_1_FOR_TIMERN</name>
									<description>CAPn.1 for TIMERn</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPN_2_FOR_TIMERN</name>
									<description>CAPn.2 for TIMERn</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAPN_3_FOR_TIMERN_NO</name>
									<description>CAPn.3 for TIMERn Note: If Counter mode is selected for a particular CAPn input in the TnCTCR, the 3 bits for that input in the Capture Control Register (TnCCR) must be programmed as 000. However, capture and/or interrupt can be selected for the other 3 CAPn inputs in the same timer.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
							
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>

		<peripheral derivedFrom="TIMER0">
			<name>TIMER1</name>
			<baseAddress>0x40085000</baseAddress>
			<interrupt>
				<name>TIMER1</name>
				<value>13</value>

			</interrupt>
		</peripheral>

		<peripheral derivedFrom="TIMER0">
			<name>TIMER2</name>
			<baseAddress>0x400C3000</baseAddress>
			<interrupt>
				<name>TIMER2</name>
				<value>14</value>

			</interrupt>
		</peripheral>

		<peripheral derivedFrom="TIMER0">
			<name>TIMER3</name>
			<baseAddress>0x400C4000</baseAddress>
			<interrupt>
				<name>TIMER3</name>
				<value>15</value>

			</interrupt>
		</peripheral>
		<peripheral>
			<name>SCU</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx System Control Unit (SCU) Modification date=6/8/2011 Major revision=0 Minor revision=10 </description>
			<groupName>SCU</groupName>
			<baseAddress>0x40086000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>SFSP0_%s</name>
					<description>Pin configuration register for pins P0</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Select pin function</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>FUNCTION_0_DEFAULT)</name>
									<description>Function 0 (default)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_1</name>
									<description>Function 1</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_2</name>
									<description>Function 2</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_3</name>
									<description>Function 3</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_4</name>
									<description>Function 4</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_5</name>
									<description>Function 5</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_6</name>
									<description>Function 6</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FUNCTION_7</name>
									<description>Function 7</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPD</name>
							<description>Enable pull-down resistor at pad</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_PULL_DOWN_</name>
									<description>Disable pull-down.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_PULL_DOWN_</name>
									<description>Enable pull-down.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPUN</name>
							<description>Disable pull-up resistor at pad. By default, the pull-up resistor is enabled at reset.</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_PULL_UP</name>
									<description>Enable pull-up</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE_PULL_UP</name>
									<description>Disable pull-up</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EHS</name>
							<description>Slew rate</description>
							<bitRange>[5:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>SLOW</name>
									<description>Slow</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAST</name>
									<description>Fast</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EZI</name>
							<description>Input buffer enable. The input buffer is disabled by default at reset but must be enabled to transfer data from the I/O buffer to the pad.</description>
							<bitRange>[6:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE_INPUT_BUFFER</name>
									<description>Disable input buffer</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE_INPUT_BUFFER</name>
									<description>Enable input buffer</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:7]</bitRange>
							
