alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
					</fields>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>1-3</dimIndex>
					<name>ADR%s</name>
					<description>I2C Slave Address Register. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address.</description>
					<addressOffset>0x020</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GC</name>
							<description>General Call enable bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>Address</name>
							<description>The I2C device address for slave mode.</description>
							<bitRange>[7:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA_BUFFER</name>
					<description>Data buffer register. The contents of the 8 MSBs of the DAT shift register will be transferred to the DATA_BUFFER automatically after every nine bits (8 bits of data plus ACK or NACK) has been received on the bus.</description>
					<addressOffset>0x02C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Data</name>
							<description>This register holds contents of the 8 MSBs of the DAT shift register.</description>
							<bitRange>[7:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>MASK%s</name>
					<description>I2C Slave address mask register</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. User software should not write ones to reserved bits. This bit reads always back as 0.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MASK</name>
							<description>Mask bits.</description>
							<bitRange>[7:1]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>

		<peripheral derivedFrom="I2C0">
			<name>I2C1</name>
			<baseAddress>0x400E0000</baseAddress>
			<interrupt>
				<name>I2C1</name>
				<value>19</value>

			</interrupt>
		</peripheral>

		<peripheral>
			<name>I2S0</name>
			<description>Product name title=UM10430 Chapter title=LPC18xx I2S interface Modification date=1/14/2011 Major revision=0 Minor revision=7 </description>
			<groupName>I2S</groupName>
			<baseAddress>0x400A2000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2S0</name>
				<value>28</value>

			</interrupt>
			<registers>
				<register>
					<name>DAO</name>
					<description>I2S Digital Audio Output Register. Contains control bits for the I2S transmit channel.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x87E1</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WORDWIDTH</name>
							<description>Selects the number of bytes in data as follows:</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>8_BIT_DATA</name>
									<description>8-bit data</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_BIT_DATA</name>
									<description>16-bit data</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED,_DO_NOT_USE</name>
									<description>Reserved, do not use this setting</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_BIT_DATA</name>
									<description>32-bit data</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONO</name>
							<description>When 1, data is of monaural format. When 0, the data is in stereo format.</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>STOP</name>
							<description>When 1, disables accesses on FIFOs, places the transmit channel in mute mode.</description>
							<bitRange>[3:3]</bitRange>
							
						</field>
						<field>
							<name>RESET</name>
							<description>When 1, asynchronously resets the transmit channel and FIFO.</description>
							<bitRange>[4:4]</bitRange>
							
						</field>
						<field>
							<name>WS_SEL</name>
							<description>When 0, the interface is in master mode. When 1, the interface is in slave mode. See Section 34.7.2 for a summary of useful combinations for this bit with TXMODE.</description>
							<bitRange>[5:5]</bitRange>
							
						</field>
						<field>
							<name>WS_HALFPERIOD</name>
							<description>Word select half period minus 1, i.e. WS 64clk period -> ws_halfperiod = 31.</description>
							<bitRange>[14:6]</bitRange>
							
