alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
					</fields>
				</register>
				<register>
					<name>CAP0_2_IN</name>
					<description>Timer 0 CAP0_2 capture  input multiplexer</description>
					<addressOffset>0x008</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOINVERT</name>
									<description>Not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Input inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>Enable rising edge detection</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOEDGE</name>
									<description>No edge detection.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISINGEDGE</name>
									<description>Rising edge detection enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNCH</name>
							<description>Enable 2ff synchronization</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable 2ff synchronization.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable 2ff synchronization.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSE</name>
							<description>Enable single pulse generation.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable single pulse generation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable single pulse generation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELECT</name>
							<description>Select input. Values 0x3 to 0xF are reserved.</description>
							<bitRange>[7:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CTIN_2</name>
									<description>CTIN_2</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESERVED</name>
									<description>Reserved</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T0_CAP2</name>
									<description>T0_CAP2</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CAP0_3_IN</name>
					<description>Timer 0 CAP0_3 capture input multiplexer</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOINVERT</name>
									<description>Not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Input inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>Enable rising edge detection</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOEDGE</name>
									<description>No edge detection.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISINGEDGE</name>
									<description>Rising edge detection enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNCH</name>
							<description>Enable 2ff synchronization</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable 2ff synchronization.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable 2ff synchronization.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSE</name>
							<description>Enable single pulse generation.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable single pulse generation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable single pulse generation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELECT</name>
							<description>Select input. Values 0x3 to 0xF are reserved.</description>
							<bitRange>[7:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CTOUT_15ORT3_MAT3</name>
									<description>CTOUT_15 or T3_MAT3</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T0_CAP3</name>
									<description>T0_CAP3</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3_MAT3</name>
									<description>T3_MAT3</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
							
