alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
						</field>
					</fields>
				</register>
				<register>
					<name>CAP3_0_IN</name>
					<description>Timer 3 CAP3_0 capture  input multiplexer</description>
					<addressOffset>0x030</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOINVERT</name>
									<description>Not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Input inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>Enable rising edge detection</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOEDGE</name>
									<description>No edge detection.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISINGEDGE</name>
									<description>Rising edge detection enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNCH</name>
							<description>Enable 2ff synchronization</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable 2ff synchronization.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable 2ff synchronization.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSE</name>
							<description>Enable single pulse generation.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable single pulse generation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable single pulse generation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELECT</name>
							<description>Select input. Values 0x3 to 0xF are reserved.</description>
							<bitRange>[7:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CTIN_0</name>
									<description>CTIN_0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TBD</name>
									<description>tbd I2S0_RX_MWS</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3_CAP0</name>
									<description>T3_CAP0</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CAP3_1_IN</name>
					<description>Timer 3 CAP3_1 capture  input multiplexer</description>
					<addressOffset>0x034</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INV</name>
							<description>Invert input</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOINVERT</name>
									<description>Not inverted.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INVERT</name>
									<description>Input inverted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>Enable rising edge detection</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOEDGE</name>
									<description>No edge detection.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISINGEDGE</name>
									<description>Rising edge detection enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNCH</name>
							<description>Enable 2ff synchronization</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable 2ff synchronization.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable 2ff synchronization.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PULSE</name>
							<description>Enable single pulse generation.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable single pulse generation.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Enable single pulse generation.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SELECT</name>
							<description>Select input. Values 0x4 to 0xF are reserved.</description>
							<bitRange>[7:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CTIN_6</name>
									<description>CTIN_6</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>U3_TXD</name>
									<description>U3_TXD</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TBD I2S0_TX_MWS</name>
									<description>TBD - I2S0_TX_MWS</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3_CAP1</name>
									<description>T3_CAP1</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:8]</bitRange>
							
