alexeyk13/rexos/3rdparty/CMSIS/Device/NXP/LPC18xx/Include/LPC18xxv19.xml
			</registers>
		</peripheral>
		<peripheral derivedFrom="ADC0">
			<name>ADC1</name>
			<baseAddress>0x400E4000</baseAddress>
			<interrupt>
				<name>ADC1</name>
				<value>21</value>

			</interrupt>
		</peripheral>
		<peripheral>
			<name>GPIO_PORT</name>
			<description>GPIO port </description>
			<groupName>GPIO_PORT</groupName>
			<baseAddress>0x400F4000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFfFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>256</dim>
					<dimIncrement>0x1</dimIncrement>
					<dimIndex>0-255</dimIndex>
					<name>B%s</name>
					<description>Byte pin registers port 0 to 5; pins PIOn_0 to PIOn_31</description>
					<addressOffset>0x0000</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PBYTE</name>
							<description>Read: state of the GPIOm[n] pin, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>

				<register>
					<dim>256</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-255</dimIndex>
					<name>W%s</name>
					<description>Word pin registers port 0 to 5</description>
					<addressOffset>0x1000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWORD</name>
							<description>Read 0: pin is LOW.  Write 0: clear output bit. Read 0xFFFF FFFF: pin is HIGH.  Write any value 0x0000 0001 to 0xFFFF FFFF: set output bit. Only 0 or 0xFFFF FFFF can be read. Writing any value other than 0 will set the output bit.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>

				<register>
					<dim>8</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>DIR%s</name>
					<description>Direction registers port m</description>
					<addressOffset>0x2000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIRP0</name>
							<description>Selects pin direction for GPIOm[n] pin (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DIRP1</name>
							<description>Selects pin direction for GPIOm[n] pin (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DIRP2</name>
							<description>Selects pin direction for  GPIOm[n] pin (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DIRP3</name>
							<description>Selects pin direction for GPIOm[n] pin (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DIRP4</name>
							<description>Selects pin direction for GPIOm[n] pin (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DIRP5</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>DIRP6</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DIRP7</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>DIRP8</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DIRP9</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DIRP10</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DIRP11</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DIRP12</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>DIRP13</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>DIRP14</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>DIRP15</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>DIRP16</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>DIRP17</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>DIRP18</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>DIRP19</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>DIRP20</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>DIRP21</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>DIRP22</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>DIRP23</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>DIRP24</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>DIRP25</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>DIRP26</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>DIRP27</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>DIRP28</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>DIRP29</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>DIRP30</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DIRP31</name>
							<description>Selects pin direction for pin GPIOm[n] (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = input. 1 = output.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-7</dimIndex>
					<name>MASK%s</name>
					<description>Mask register port m</description>
					<addressOffset>0x2080</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MASKP0</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>MASKP1</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>MASKP2</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>MASKP3</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>MASKP4</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the P0/1PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>MASKP5</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>MASKP6</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>MASKP7</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>MASKP8</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>MASKP9</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>MASKP10</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>MASKP11</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>MASKP12</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>MASKP13</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>MASKP14</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>MASKP15</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>MASKP16</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>MASKP17</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>MASKP18</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>MASKP19</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>MASKP20</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>MASKP21</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>MASKP22</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>MASKP23</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>MASKP24</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>MASKP25</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>MASKP26</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>MASKP27</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>MASKP28</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>MASKP29</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>MASKP30</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>MASKP31</name>
							<description>Controls which bits corresponding to GPIOm[n] are active in the  PIN register (bit 0 = GPIOm[0], bit 1 = GPIOm[1], ..., bit 31 = GPIOm[31]). 0 = Read MPORT: pin state; write MPORT: load output bit. 1 = Read MPORT: 0; write MPORT: output bit not affected.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
